{
    "article_name": "Зачем Программисту Микроконтроллеров Диофантовы Уравнения",
    "article_content": [
        "Пролог",
        "В математике есть такая тема как Диофантовы уравнения. В самом простом виде выглядят они так.",
        "Тут одно уравнение и две неизвестные: x,y. При этом a, b, d - это известные константы. ",
        "На первый взгляд может показаться как бесполезная вещь для программирования Micro Controller Unit (MCU), но не тут-то было.",
        "Когда программируешь микроконтроллер (MCU), то первое, что приходится делать - это конфигурировать тактирование процессорного ядра. Тактированием заправляет устройство с названием phase-locked loop (PLL/ФАПЧ). Это подсистема SoC(а).",
        "И там надо подобрать три константы (натуральных числа): M, N и F. В микроконтроллере Artery, абстрактно изображая, эта электрическая цепь выглядит вот так. Умножители и делители частот.",
        "По формуле (2)",
        "Вычисляется системная частота F_sys (sclk). Это уравнение (2) преобразуется в уравнение (3)",
        "А уравнение (3), в свою очередь, это самое настоящее Диофантово уравнение! Да.. Тут F_quartz - это частота кварцевого резонатора, который задается схемотехникой электронной платы. F_sys задается программистом для достижения желаемой производительности прошивки. Остаются целочисленные неизвестные N, M  и F.Далее накладываются ещё ограничения уже производителем микроконтроллера. Для Artery это ",
        "Переменная",
        "Минимальное",
        "Максимальное",
        "M",
        "1",
        "15",
        "N",
        "31",
        "500",
        "FR (степени двойки)",
        "1",
        "32",
        "Это ограничение даже прописано комментариями в исходных кодах на Cи, которые бесплатно предоставляет производитель Artery Tech.",
        "Итак, постановка задачи:",
        "Есть электронная плата с Artery MCU . На PCB припаян кварцевый резонатор c частотой 8 MHz и подключен к MCU. Необходимо программно сконфигурировать системную частоту ядра ровно на 100 MHz.",
        "Какими при этом должны быть коэффициенты PLL: N, M и RF?",
        "Решение",
        "По сути, задача свелась к тому чтобы решить Диофантово уравнение (4).",
        "Можно попробовать прибегнуть к помощи Artificial intelligence (AI) на сайте Wolfram Alfa",
        "Однако это не решение в частном виде. На практике же нужно численное решение, чтобы проинициализировать им функцию crm_pll_config(). ",
        "Однако нам повезло. В частности, тут область значений функции (2) достаточно маленькая, поэтому можно найти решение уравнения (3) обыкновенным перебором. ",
        "Для этого я написал свой простой численный решатель Диофантова уравнения для PLL прямо на Си.",
        "Вот так, в симуляторе прошивки на PC я исполнил команду обсчета PLL и получил аж  5 решений на выбор.",
        "Далее подставив четвёртое решение в утилиту проверки PLL я увидел, что конфиг валидный! ",
        "Успех!",
        "Как видите, программирование микроконтроллеров требует математической подготовки. А как Вы хотели?",
        "Благодаря способности решать Диофантовы уравнения, Вы можете переконфигурировать частоту процессора далеко в run-time.",
        "Можно, например, перейти в режим энергосбережения специально понизив частоту ядра. Или увеличить для ускорения расчета какой-то сложной математической процедуры. ",
        "Вот так..",
        "Links/URLs",
        "https://www.wolframalpha.com/input?i=8000000x-100000000y%3D0",
        "http://latex.codecogs.com/eqneditor/editor.php ",
        "https://ru.wikipedia.org/wiki/Диофантово_уравнение",
        ""
    ]
}